app/controllers/runs_controller.rb

SELECT  "runs".* FROM "runs" WHERE "runs"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "runs".* FROM "runs" WHERE "runs"."user_id" = ? AND "runs"."team_id" = ? LIMIT ?  [["user_id", 1], ["team_id", 2], ["LIMIT", 1]]
---
  def index
    # find by user
    if !params[:user_id].nil? && params[:team_id].nil?
      @runs = Run.find_by user_id: params[:user_id]
    end

    # find by team
    if params[:user_id].nil? && !params[:team_id].nil?
      @runs = Run.find_by team_id: params[:team_id]

INSERT INTO "runs" ("distance", "user_id", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["distance", #<BigDecimal:5588d9e4fdd8,'0.3E1',9(27)>], ["user_id", 1], ["team_id", 1], ["created_at", 2017-06-05 16:54:30 UTC], ["updated_at", 2017-06-05 16:54:30 UTC]]
---
  def create
    # .new() creates but does not save
    # .create() creates, saves, and returns the object
    @run = Run.create(run_params.except(:id))

UPDATE "runs" SET "run_date" = ?, "updated_at" = ? WHERE "runs"."id" = ?  [["run_date", 2017-06-05 05:00:00 UTC], ["updated_at", 2017-06-11 04:59:31 UTC], ["id", 1]]
---
  def update
    if !run_params[:run_date].nil?
      @run[:run_date] = run_params[:run_date]
    end

    if !run_params[:distance].nil?
      @run[:distance] = run_params[:distance]
    end

    if !run_params[:event].nil?
      @run[:event] = run_params[:event]
    end

    if @run.save!

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_run
    @run = Run.find(params[:id])