app/controllers/team_owners_controller.rb

  def show
    team_miles = Run.where(user_id: params['id']).group(:team_id).calculate(:sum, :distance)

    allteams = []
    @user.teams.each do |team|
---
SELECT "runs".* FROM "runs" WHERE "runs"."user_id" = ?  [["user_id", 34]]
SELECT SUM("runs"."distance") AS sum_distance, "runs"."team_id" AS runs_team_id FROM "runs" WHERE "runs"."user_id" = ? GROUP BY "runs"."team_id"  [["user_id", 34]]
SELECT "teams".* FROM "teams" INNER JOIN "team_member_lists" ON "teams"."id" = "team_member_lists"."team_id" WHERE "team_member_lists"."user_id" = ?  [["user_id", 34]]

  def create
    @user = TeamOwner.create(owner_params.except(:id, :team_id))
---
INSERT INTO "users" ("uid", "encrypted_password", "confirmation_token", "confirmation_sent_at", "first_name", "last_name", "email", "type", "tokens", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)