app/controllers/teams_controller.rb

  def show
    users = []
    @team.users.each do |user|
      tmp = {}
      tmp[:id] = user.id
      tmp[:first_name] = user.first_name
      tmp[:last_name] = user.last_name
      team_distance = 0
      team_run_count = 0
      user.runs.each do |run|
---
SELECT "users".* FROM "users" INNER JOIN "team_member_lists" ON "users"."id" = "team_member_lists"."user_id" WHERE "team_member_lists"."team_id" = ?  [["team_id", 1]]
SELECT "runs".* FROM "runs" WHERE "runs"."user_id" = ?  [["user_id", 1]]

  def create
    @owner = User.find_by_id(team_params[:team_owner_id])
    if @owner.nil?
      render json: { errors: 'no user with submitted owner id'}, status: :unprocessable_entity and return
    end

    @team = Team.create(team_params.except(:id))
---
SELECT  "users".* FROM "users" WHERE "users"."type" IN ('TeamOwner') AND "users"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
INSERT INTO "teams" ("name", "team_owner_id", "created_at", "updated_at", "contact_email") VALUES (?, ?, ?, ?, ?)  [["name", "Next Goal Runners"], ["team_owner_id", 34], ["created_at", 2017-06-20 21:38:08 UTC], ["updated_at", 2017-06-20 21:38:08 UTC], ["contact_email", "coachkruser@gmail.com"]]

  def delete
    @team = Team.find(params[:id]).destroy
---
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 2]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]