app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kruser14@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    # check logged in user:
    # - if user_type = admin, show all
    # - if user_type = owner, show users on their team(s) and friends
    # - if user_type = user, show friends
    if !params['email'].nil?
      @user = User.find_by_email(params[:email])
      render(json: { user: user_return_obj }, status: 200) && return
    else
      all_users = if !params[:team_id].nil?
                    Team.find(params[:team_id]).users
                  else
                    User.all

SELECT "runs".* FROM "runs" WHERE "runs"."user_id" = ?  [["user_id", 1]]
SELECT SUM("runs"."distance") AS sum_distance, "runs"."team_id" AS runs_team_id FROM "runs" WHERE "runs"."user_id" = ? GROUP BY "runs"."team_id"  [["user_id", 1]]
---
  def show
    team_miles = Run.where(user_id: params['id']).group(:team_id).calculate(:sum, :distance)

SELECT  1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER(?) AND ("users"."id" != ?) LIMIT ?  [["email", "admin@test.com"], ["id", 1], ["LIMIT", 1]]
---
  def create
    # .new() creates but does not save
    # .create() creates, saves if valid, and returns the object (regardless if valid)

    @user = User.new(user_params.except(:id, :team_id))

    puts @user.inspect
    send_confirmation = true;

    if @user[:email].empty?

INSERT INTO "users" ("name", "email", "user_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Justin Kruse"], ["email", "kruser14@gmail.com"], ["user_type", "user"], ["created_at", 2017-06-09 02:36:56 UTC], ["updated_at", 2017-06-09 02:36:56 UTC]]
INSERT INTO "team_member_lists" ("created_at", "updated_at", "user_id", "team_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-06-09 02:51:56 UTC], ["updated_at", 2017-06-09 02:51:56 UTC], ["user_id", 6], ["team_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    end

    begin
      if @user.save!
        unless user_params[:team_id].nil?
          TeamMemberList.create(user_id: @user.id, team_id: user_params[:team_id])
        end

        @user = User.find(@user.id)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def delete
    @user = User.find(params[:id]).destroy