app/controllers/users_controller.rb

  def show
    team_miles = Run.where(:user_id => params['id']).group(:team_id).calculate(:sum,:distance)

    @user.teams.each do |team|
---
SELECT "teams".* FROM "teams" INNER JOIN "team_member_lists" ON "teams"."id" = "team_member_lists"."team_id" WHERE "team_member_lists"."user_id" = ?  [["user_id", 1]]